app/Http/Controllers/KecamatanController.php

public function index(){
	$datakecamatan = Kecamatan::orderby('nama')->get();
---
select * from `tb_kecamatan` order by `nama` asc

public function update($idkecamatan){
	$datakecamatan = Kecamatan::orderby('nama')->get();
	$kecamatan = Kecamatan::find($idkecamatan);
	$datastatus = Lov::where('kategori','status')->get();
---
select * from `tb_kecamatan` order by `nama` asc
select * from `tb_kecamatan` where `tb_kecamatan`.`idkecamatan` = '9' limit 1
select * from `tb_lov` where `kategori` = 'status'

public function manage(Request $request){
	if($request -> action == 'insert'){
		$kecamatan = new Kecamatan;
		// $kecamatan -> idkecamatan = $request -> idkecamatan;
		$kecamatan -> nama = $request -> nama;
		$kecamatan -> kode = $request -> kode;
		$kecamatan -> status = $request -> status;
		$kecamatan -> modified_by = session()->get('username');
		// $kecamatan -> at = $request -> at;
		// $kecamatan -> updated_at = $request -> updated_at;
		$kecamatan -> save();
	}
	else if($request -> action == 'update'){
		$kecamatan = Kecamatan::find($request -> idkecamatan);
---
select * from `tb_kecamatan` where `tb_kecamatan`.`idkecamatan` = '9' limit 1