app/Http/Controllers/KonsultanController.php

select * from `tb_konsultan` order by `nama` asc
---
public function index(){
	$datakonsultan = Konsultan::orderby('nama','asc')->get();