app/Http/Controllers/LogController.php

select * from `tb_log` order by `updated_at` desc limit 15 offset 0
select count(*) as aggregate from `tb_log`
---
public function index(){
	$datalog = Log::orderBy('updated_at', 'desc')->paginate(15);