app/Http/Controllers/LoginController.php

public function ceklogin(Request $request)
{
	# Cek Username dan LogicException
  $pengguna = Username::where('username',$request->username)->where('password',md5($request->password))->first();
---
select * from `tb_username` where `username` = 'rionorman' and `password` = 'ac43724f16e9241d990427ab7c8f4228' limit 1