app/Http/Controllers/LovController.php

public function index(){
	$datalov = Lov::orderby('kategori')->get();
---
select * from `tb_lov` order by `kategori` asc