app/Http/Controllers/UsernameController.php

public function index(){
	$datausername = Username::orderby('username')->get();
---
select * from `tb_username` order by `username` asc